# ruff: noqa: E501

from importlib.util import find_spec
from itertools import zip_longest

import pytest


@pytest.mark.parametrize("cut_at_seconds", [0, 10])
def test_simple(cut_at_seconds: float) -> None:
    if find_spec("aeneas") is None:
        pytest.skip("Aeneas is not installed")

    from forced_alignment import TimedText, split_audio

    def eq_time_text(tt1: TimedText, tt2: TimedText) -> bool:
        """Just ignore the title since it depends on cut_at_seconds."""
        return tt1.begin == tt2.begin and tt1.end == tt2.end and tt1.text == tt2.text

    fragments = [
        {
            "begin": "0.000",
            "children": [],
            "end": "2.240",
            "id": "f000001",
            "language": "ell",
            "lines": ["(A2) 7. Το δελφίνι"],
        },
        {
            "begin": "2.240",
            "children": [],
            "end": "2.680",
            "id": "f000002",
            "language": "ell",
            "lines": ["Το δελφίνι"],
        },
        {
            "begin": "2.680",
            "children": [],
            "end": "18.320",
            "id": "f000003",
            "language": "ell",
            "lines": [
                "Θα μπορούσε κανείς να το πει «άλογο της θάλασσας». Και γρήγορο σαν άλογο είναι και στην ανάσα το άλογο θυμίζει. Φρρ! κάνει δυνατά κάθε φορά, που βγαίνει επάνω, και σαν άλογο προσφέρεται για… ιππασία."
            ],
        },
        {
            "begin": "18.320",
            "children": [],
            "end": "44.240",
            "id": "f000004",
            "language": "ell",
            "lines": [
                "(…) Οι ναυτικοί τα καμαρώνουν. Περνούν την ώρα μαζί τους. Τους αρέσει πολύ αυτό το θαλασσινό ζώο, γιατί δεν πειράζει τον άνθρωπο ποτέ. Κολυμπά σαν γοργόνα, τρελαίνεται για τη μουσική. Μα οι ψαράδες για το δελφίνι έχουν γνώμη διαφορετική, εντελώς αντίθετη. Γι' αυτούς είναι ένας φαγάς διάσημος, ένας επικίνδυνος εχθρός."
            ],
        },
        {
            "begin": "44.240",
            "children": [],
            "end": "74.520",
            "id": "f000006",
            "language": "ell",
            "lines": [
                "Μην τους μιλάτε για μουσική, για ποίηση, για… θαλασσινές ιπποδρομίες. Μετρείστε καλύτερα τα ψάρια, που τους κλέβει ο μεγάλος φαγάς! Ψάρια για ψάρια δεν αφήνει. Κι όταν δεν βρει ψάρια, τρώει τα χταπόδια και τα καβούρια. Διακόσια δόντια έχει. Κι όλα πρέπει να δουλέψουν. Πάλι καλά που γεννάει ένα μικρό κάθε ένα με δύο χρόνια. Αλλιώς τα ψάρια θα τα βλέπαμε μόνο στο ζωολογικό κήπο."
            ],
        },
    ]
    text_files = [
        (
            "DummyTitle",
            [
                "(A2) 7. Το δελφίνι",
                "Το δελφίνι",
                "Θα μπορούσε κανείς να το πει «άλογο της θάλασσας». Και γρήγορο σαν άλογο είναι και στην ανάσα το άλογο θυμίζει. Φρρ! κάνει δυνατά κάθε φορά, που βγαίνει επάνω, και σαν άλογο προσφέρεται για… ιππασία.",
            ],
        ),
        (
            "DummyTitle",
            [
                "(…) Οι ναυτικοί τα καμαρώνουν. Περνούν την ώρα μαζί τους. Τους αρέσει πολύ αυτό το θαλασσινό ζώο, γιατί δεν πειράζει τον άνθρωπο ποτέ. Κολυμπά σαν γοργόνα, τρελαίνεται για τη μουσική. Μα οι ψαράδες για το δελφίνι έχουν γνώμη διαφορετική, εντελώς αντίθετη. Γι' αυτούς είναι ένας φαγάς διάσημος, ένας επικίνδυνος εχθρός."
            ],
        ),
        (
            "DummyTitle",
            [
                "Μην τους μιλάτε για μουσική, για ποίηση, για… θαλασσινές ιπποδρομίες. Μετρείστε καλύτερα τα ψάρια, που τους κλέβει ο μεγάλος φαγάς! Ψάρια για ψάρια δεν αφήνει. Κι όταν δεν βρει ψάρια, τρώει τα χταπόδια και τα καβούρια. Διακόσια δόντια έχει. Κι όλα πρέπει να δουλέψουν. Πάλι καλά που γεννάει ένα μικρό κάθε ένα με δύο χρόνια. Αλλιώς τα ψάρια θα τα βλέπαμε μόνο στο ζωολογικό κήπο."
            ],
        ),
    ]

    expected = [
        TimedText(
            title="DummyTitle",
            begin="0.000",
            end="18.320",
            text="(A2) 7. Το δελφίνι\nΤο δελφίνι\nΘα μπορούσε κανείς να το πει «άλογο της θάλασσας». Και γρήγορο σαν άλογο είναι και στην ανάσα το άλογο θυμίζει. Φρρ! κάνει δυνατά κάθε φορά, που βγαίνει επάνω, και σαν άλογο προσφέρεται για… ιππασία.",
        ),
        TimedText(
            title="DummyTitle",
            begin="18.320",
            end="44.240",
            text="(…) Οι ναυτικοί τα καμαρώνουν. Περνούν την ώρα μαζί τους. Τους αρέσει πολύ αυτό το θαλασσινό ζώο, γιατί δεν πειράζει τον άνθρωπο ποτέ. Κολυμπά σαν γοργόνα, τρελαίνεται για τη μουσική. Μα οι ψαράδες για το δελφίνι έχουν γνώμη διαφορετική, εντελώς αντίθετη. Γι' αυτούς είναι ένας φαγάς διάσημος, ένας επικίνδυνος εχθρός.",
        ),
        TimedText(
            title="DummyTitle",
            begin="44.240",
            end="74.520",
            text="Μην τους μιλάτε για μουσική, για ποίηση, για… θαλασσινές ιπποδρομίες. Μετρείστε καλύτερα τα ψάρια, που τους κλέβει ο μεγάλος φαγάς! Ψάρια για ψάρια δεν αφήνει. Κι όταν δεν βρει ψάρια, τρώει τα χταπόδια και τα καβούρια. Διακόσια δόντια έχει. Κι όλα πρέπει να δουλέψουν. Πάλι καλά που γεννάει ένα μικρό κάθε ένα με δύο χρόνια. Αλλιώς τα ψάρια θα τα βλέπαμε μόνο στο ζωολογικό κήπο.",
        ),
    ]

    timed_texts = split_audio(fragments, text_files, cut_at_seconds)
    for tt_res, tt_exp in zip_longest(timed_texts, expected):
        assert eq_time_text(tt_res, tt_exp)
